<?php

return array (

  'quotes-dumb' => array ('"'),

  'quotes' => array ('«', '„', '“', '»'),

  'quotes-auto-depth' => true,

  'dash' => '—',

  'replacements' => array (

    'і т.д.'  => 'і т. д.',
    'і т. д.' => 'і т. д.',
    'і т.п.'  => 'і т. п.',
    'і т. п.' => 'і т. п.',

    'І т.д.'  => 'І т. д.',
    'І т. д.' => 'І т. д.',
    'І т.п.'  => 'І т. п.',
    'І т. п.' => 'І т. п.',

    'т.я.'  => 'т. я.',
    'т. я.' => 'т. я.',
    'г.зн.'  => 'г. зн.',
    'г. зн.' => 'г. зн.',
    'т.ч.'  => 'т. ч.',
    'т. ч.' => 'т. ч.',
    'т.н.'  => 'т. н.',
    'т. н.' => 'т. н.',

    'Т.я.'  => 'Т. я.',
    'Т. я.' => 'Т. я.',
    'Г.зн.'  => 'Г. зн.',
    'Г. зн.' => 'Г. зн.',
    'Т.ч.'  => 'Т. ч.',
    'Т. ч.' => 'Т. ч.',
    'Т.н.'  => 'Т. н.',
    'Т. н.' => 'Т. н.',

    '--'  => '—',
    '–'   => '—',
    ' —'  => ' —',

    'e.g.'  => 'e. g.',
    'e. g.' => 'e. g.',
    'E.g.'  => 'E. g.',
    'E. g.' => 'E. g.',

    "'" => '’',
    '"' => '”',

  ),

  'nobreak' => array (

    'з-за',
    'з-пад',

    'из-за',
    'из-под',
    
  ),

  'with-next' => '(а|ў|ды|і|да|аб|з|у|ў|без|для|да|за|з|на|над|не|ні|але|ад|па|пад|пры|пра|a|an|as|and|\&|at|but|by|for|in|no|not|of|on|or|per|the|to|\$|€|£)', // альбо|

  'with-prev' =>
  '(б|бы|ж|₽|\$|€|£)',

);


?>
