<?php

return array (
  
  'quotes-dumb' => array ('"'),

  'quotes' => array ('«', '„', '“', '»'),

  'quotes-auto-depth' => true,

  'dash' => '—',
  
  'replacements' => array (

    'і т.д.'  => 'і т. д.',
    'і т. д.' => 'і т. д.',
    'і под.'  => 'і под.',
    'і т. ін' => 'і т. ін.',
    'і т.ін.' => 'і т. ін.',
    'та ін.'  => 'та ін.',
    'н. е.'   => ' н. е.',
    ' н. е.'  => ' н. е.',

    'и т.д.'  => 'и т. д.',
    'и т. д.' => 'и т. д.',
    'и т.п.'  => 'и т. п.',
    'и т. п.' => 'и т. п.',

    'І т.д.'  => 'І т. д.',
    'І т. д.' => 'І т. д.',
    'І под.'  => 'І под.',
    'І т. ін' => 'І т. ін.',
    'І т.ін.' => 'І т. ін.',
    'Та ін.'  => 'Та ін.',

    'И т.д.'  => 'И т. д.',
    'И т. д.' => 'И т. д.',
    'И т.п.'  => 'И т. п.',
    'И т. п.' => 'И т. п.',

    'т.з.'  => 'т. з.',
    'т. з.' => 'т. з.',

    'т.к.'  => 'т. к.',
    'т. к.' => 'т. к.',
    'т.е.'  => 'т. е.',
    'т. е.' => 'т. е.',
    'т.о.'  => 'т. о.',
    'т. о.' => 'т. о.',
    'т.н.'  => 'т. н.',
    'т. н.' => 'т. н.',

    'Т.з.'  => 'Т. з.',
    'Т. з.' => 'Т. з.',

    'Т.к.'  => 'Т. к.',
    'Т. к.' => 'Т. к.',
    'Т.е.'  => 'Т. е.',
    'Т. е.' => 'Т. е.',
    'Т.о.'  => 'Т. о.',
    'Т. о.' => 'Т. о.',
    'Т.н.'  => 'Т. н.',
    'Т. н.' => 'Т. н.',

    '--'   => '—',
    '–'    => '—',
    ' —'   => ' —',

    'e.g.'  => 'e. g.',
    'e. g.' => 'e. g.',
    'E.g.'  => 'E. g.',
    'E. g.' => 'E. g.',

    "'" => '’',
    '"' => '”',
    
  ),
  
  'nobreak' => array (
    
    'із-за',
    'з-під',
    'з-за',
    'з-над',
    'з-перед',
    'з-під',
    'із-під',
    'з-поза',
    'з-поміж',
    'з-проміж',
    'з-понад',
    'з-поперед',
    'з-посеред',
    'з-серед',
    'отож-то',
    'тим-то',
    'тільки-но',
    'тому-то',
    'отож-бо',

    'из-за',
    'из-под',

  ),

  'with-next' => '(а|в|та|і|ід|ік|к|й|до|об|з|зі|зо|у|без|біля|для|до|за|із|чи|на|над|не|ні|від|по|під|при|про|о|об|a|an|as|and|\&|at|but|by|for|in|no|not|of|on|or|per|the|to|во|въ|да|и|ко|къ|обо|объ|с|со|cъ|из|изъ|или|ни|но|от|отъ|под|\$|€|£)', // після|повз|поза|безо|безъ|надъ|подъ|

  'with-prev' => 
  '(б|би|ж|же|бы|ль|ли|₽|\$|€|£)',
  
);


?>
